Examinator/src/Enums/ТипыЭлектронныхКурсов/ТипыЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхКурсов</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Учебник</name>
  </enumValues>
  <enumValues>
    <name>Слайдовый</name>
  </enumValues>
  <enumValues>
    <name>SCORM</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/CommonModules/РазработкаЭлектронныхКурсовПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывается при записи нового электронного курса в режиме редактирования.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - новый электронный курс.
//   КонтекстРедактирования - Структура - произвольные данные, переданные из внешней подсистемы
//                            в метод ИзучениеЭлектронныхКурсовКлиент.СоздатьЭлектронныйКурс.
//
Процедура ПриЗаписиНовогоЭлектронногоКурса(ЭлектронныйКурс, КонтекстРедактирования) Экспорт
	Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(ЭлектронныйКурс, КонтекстРедактирования);	
КонецПроцедуры

// Вызывается при окончании редактирования электронного курса,
// если пользователь не отказался от публикации изменений.
// Так же это событие вызывается при окончании копирования
// нередактируемых курсов SCORM.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Отредактированный электронный курс.
//
Процедура ПриОкончанииРедактированияЭлектронногоКурса(ЭлектронныйКурс) Экспорт	
	Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(ЭлектронныйКурс);
КонецПроцедуры

// Обработчик вызывается после загрузки курсов в базу.
//
// Параметры:
//   МассивЗагруженныхКурсов - Массив - массив ссылок типа СправочникСсылка.ЭлектронныеКурсы.
//
Процедура ПослеЗагрузкиЭлектронногоКурсаВБазу(МассивЗагруженныхКурсов) Экспорт	
	Для каждого ЭлектронныйКурс Из МассивЗагруженныхКурсов Цикл
		Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(ЭлектронныйКурс);
	КонецЦикла;	
КонецПроцедуры

// Определяет доступные для создания типы электронных курсов.
// Вызывается при открытии формы списка электронных курсов.
//
// Параметры:
//   ТипыЭлектронныхКурсов - Массив - массив доступных типов курсов ПеречислениеСсылка.ТипыЭлектронныхКурсов.
//   СтандартнаяОбработка - Булево - при значении Истина можно определить свой набор типов курсов.
//
Процедура ПриОпределенииВариантаИнтерфейса(ТипыЭлектронныхКурсов, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ТипыЭлектронныхКурсов.Добавить(Перечисления.ТипыЭлектронныхКурсов.Слайдовый);
	ТипыЭлектронныхКурсов.Добавить(Перечисления.ТипыЭлектронныхКурсов.Учебник);		
	
КонецПроцедуры

// Вызывается при установки или снятии пометки удаления курса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - курс, который удаляется или снимается с удаления.
//   ПометкаУдаления - Булево - пометка удаления.
//
Процедура ПриУстановкеСнятииПометкиУдаленияЭлектронногоКурса(Знач ЭлектронныйКурс, Знач ПометкаУдаления) Экспорт
	Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(ЭлектронныйКурс);
КонецПроцедуры

// Вызывается при копировании электронного курса.
//
// Параметры:
//   НовыйЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - курс, созданный копированием.
//   СтарыйЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - скопированный курс.
//
Процедура ПриКопированииЭлектронногоКурса(Знач НовыйЭлектронныйКурс, Знач СтарыйЭлектронныйКурс) Экспорт	
	
КонецПроцедуры

#КонецОбласти
